
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Motion 动效 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="communication.html" />
    
    
    <link rel="prev" href="interaction.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction 介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="./">
            
                <a href="./">
            
                    
                    Foundation 基础
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="color.html">
            
                <a href="color.html">
            
                    
                    Color 色彩
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="typography.html">
            
                <a href="typography.html">
            
                    
                    Typography 字体与排版
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="icon.html">
            
                <a href="icon.html">
            
                    
                    Icon 图标
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="shape.html">
            
                <a href="shape.html">
            
                    
                    Shape 形状
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.5" data-path="layout.html">
            
                <a href="layout.html">
            
                    
                    Layout 布局
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.6" data-path="navigation.html">
            
                <a href="navigation.html">
            
                    
                    Navigation 导航
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.7" data-path="layer.html">
            
                <a href="layer.html">
            
                    
                    Layer 图层
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.8" data-path="interaction.html">
            
                <a href="interaction.html">
            
                    
                    Interaction 交互
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2.9" data-path="motion.html">
            
                <a href="motion.html">
            
                    
                    Motion 动效
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.10" data-path="communication.html">
            
                <a href="communication.html">
            
                    
                    Communication 沟通
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >Motion 动效</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <p><strong><span style="color: red;">&#x539F;&#x89C4;&#x8303;&#x6CA1;&#x6709;&#x6D89;&#x53CA;&#xFF0C;&#x5C5E;&#x4E8E;&#x65B0;&#x589E;&#x7AE0;&#x8282;</span></strong></p>
<h1 id="&#x6982;&#x8FF0;">&#x6982;&#x8FF0;</h1>
<ul>
<li><p>&#x52A8;&#x6548;&#x80FD;&#x52A0;&#x5F3A;&#x7528;&#x6237;&#x8BA4;&#x77E5;&#x4E14;&#x589E;&#x52A0;&#x6D3B;&#x529B;</p>
</li>
<li><p>&#x52A8;&#x6548;&#x4F7F;&#x5F97;&#x4E0E;&#x7528;&#x6237;&#x7684;&#x6C9F;&#x901A;&#x66F4;&#x52A0;&#x6E05;&#x6670;&#xFF0C;&#x5E2E;&#x52A9;&#x7528;&#x6237;&#x76F4;&#x8FBE;&#x64CD;&#x4F5C;&#x4EFB;&#x52A1;</p>
</li>
<li><p>&#x52A8;&#x6548;&#x4F7F;UI&#x5BCC;&#x6709;&#x8868;&#x73B0;&#x529B;&#x4E14;&#x6613;&#x4E8E;&#x4F7F;&#x7528;</p>
</li>
</ul>
<blockquote>
<p>&#x53C2;&#x8003; <a href="https://material.io/design/motion/understanding-motion.html" target="_blank">Material Design- understanding motion</a>&#x3001;<a href="https://design.teambition.com/visual-motion" target="_blank">Clarity Design - &#x52A8;&#x6548;</a>&#x3001;<a href="https://ant.design/docs/spec/motion-cn" target="_blank">Ant Design - &#x52A8;&#x6548;</a></p>
</blockquote>
<h1 id="&#x539F;&#x5219;">&#x539F;&#x5219;</h1>
<ul>
<li><p>&#x81EA;&#x7136;&#xFF1A;&#x81EA;&#x7136;&#x8FD0;&#x52A8;&#x89C4;&#x5F8B;&#xFF0C;&#x4FDD;&#x8BC1;&#x89C6;&#x89C9;&#x8FDE;&#x60EF;&#xFF0C;&#x8BA9;&#x7528;&#x6237;&#x611F;&#x77E5;&#x5230;&#x52A8;&#x4F5C;&#x662F;&#x6210;&#x7ACB;&#x7684;&#x3002;&#x9075;&#x5FAA;&#x5BA2;&#x89C2;&#x7269;&#x7406;&#x4E16;&#x754C;&#x7684;&#x89C4;&#x5F8B;&#x3002;&#x5982;&#xFF1A;&#x52A0;&#x901F;&#x8FD0;&#x52A8;&#x3001;&#x51CF;&#x901F;&#x8FD0;&#x52A8;&#x3002;&#x9002;&#x5F53;&#x5730;&#x5C06;&#x7269;&#x7406;&#x8FD0;&#x52A8;&#x89C4;&#x5F8B;&#x8FD0;&#x7528;&#x5728;&#x52A8;&#x6548;&#x4E2D;&#xFF0C;&#x66F4;&#x52A0;&#x7B26;&#x5408;&#x7528;&#x6237;&#x7684;&#x8BA4;&#x77E5;&#x903B;&#x8F91;&#xFF0C;&#x51CF;&#x5C11;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x8BA4;&#x77E5;&#x6210;&#x672C;</p>
</li>
<li><p>&#x9AD8;&#x6548;&#xFF1A;&#x5C3D;&#x91CF;&#x8282;&#x7701;&#x8FC7;&#x6E21;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x5FEB;&#x901F;&#x5B8C;&#x6210;&#x8FC7;&#x6E21;&#x7684;&#x52A8;&#x753B;&#x6548;&#x679C;&#x3002;&#x82E5;&#x52A8;&#x753B;&#x65F6;&#x95F4;&#x8FC7;&#x957F;&#xFF0C;&#x4F1A;&#x8BA9;&#x7528;&#x6237;&#x4EA7;&#x751F;&#x62D6;&#x6C93;&#x3001;&#x4F4E;&#x6548;&#x7684;&#x5370;&#x8C61;&#xFF0C;&#x963B;&#x788D;&#x7528;&#x6237;&#x7684;&#x64CD;&#x4F5C;</p>
</li>
<li><p>&#x514B;&#x5236;&#xFF1A;&#x505A;&#x6709;&#x610F;&#x4E49;&#x7684;&#x52A8;&#x6548;&#xFF0C;&#x4E0D;&#x53BB;&#x505A;&#x592A;&#x591A;&#x7684;&#x4FEE;&#x9970;&#x548C;&#x5E72;&#x6270;&#x7528;&#x6237;&#x3002;&#x5728;&#x7528;&#x6237;&#x754C;&#x9762;&#x4E2D;&#x4F7F;&#x7528;&#x8F7B;&#x76C8;&#x7684;&#x52A8;&#x753B;&#xFF0C;&#x51CF;&#x5C11;&#x52A8;&#x6548;&#x7684;&#x7A81;&#x5140;&#x611F;&#xFF0C;&#x6709;&#x52A9;&#x4E8E;&#x8425;&#x9020;&#x66F4;&#x8F7B;&#x677E;&#x3001;&#x6E05;&#x723D;&#x7684;&#x6C1B;&#x56F4;</p>
</li>
<li><p>&#x529B;&#x5EA6;&#x5DEE;&#x5F02;&#xFF1A;&#x4E3A;&#x4E0D;&#x540C;&#x7684;&#x4EA4;&#x4E92;&#x7EC4;&#x4EF6;&#x63D0;&#x4F9B;&#x4E0D;&#x540C;&#x7684;&#x8FD0;&#x52A8;&#x529B;&#x5EA6;&#xFF0C;&#x529B;&#x5EA6;&#x8D8A;&#x5927;&#x7684;&#x8FD0;&#x52A8;&#x4EE3;&#x8868;&#x64CD;&#x4F5C;&#x8D8A;&#x91CD;&#x8981;&#xFF0C;&#x53EF;&#x4EE5;&#x65E0;&#x5F62;&#x4E4B;&#x4E2D;&#x5728;&#x5927;&#x8111;&#x4E2D;&#x5EFA;&#x7ACB;&#x4E0E;&#x73B0;&#x5B9E;&#x7269;&#x7406;&#x8FD0;&#x52A8;&#x7684;&#x5173;&#x8054;&#xFF0C;&#x52A0;&#x5F3A;&#x7528;&#x6237;&#x7684;&#x611F;&#x77E5;</p>
</li>
<li><p>&#x4FE1;&#x606F;&#x5316;&#xFF1A;&#x663E;&#x793A;&#x5143;&#x7D20;&#x4E4B;&#x95F4;&#x7684;&#x7A7A;&#x95F4;&#x548C;&#x5C42;&#x6B21;&#x5173;&#x7CFB;&#xFF0C;&#x54EA;&#x4E9B;&#x64CD;&#x4F5C;&#x53EF;&#x7528;&#xFF0C;&#x4EE5;&#x53CA;&#x5982;&#x679C;&#x91C7;&#x53D6;&#x64CD;&#x4F5C;&#x5C06;&#x4F1A;&#x53D1;&#x751F;&#x4EC0;&#x4E48;</p>
</li>
</ul>
<blockquote>
<p>&#x53C2;&#x8003; <a href="https://material.io/design/motion/understanding-motion.html#" target="_blank">Material Design- Principles</a>&#x3001;<a href="https://design.teambition.com/visual-motion" target="_blank">Clarity Design - &#x539F;&#x5219;</a>&#x3001;<a href="https://motion.ant.design/language/principle-cn" target="_blank">Ant Motion - &#x539F;&#x5219;</a></p>
</blockquote>
<h1 id="&#x901F;&#x5EA6;">&#x901F;&#x5EA6;</h1>
<p>&#x5728;&#x4F01;&#x4E1A;&#x7EA7;&#x5E94;&#x7528;&#x7684;&#x8BBE;&#x8BA1;&#x4E2D;&#xFF0C;&#x52A8;&#x6548;&#x9700;&#x8981;&#x5728;&#x5C3D;&#x53EF;&#x80FD;&#x77ED;&#x7684;&#x65F6;&#x95F4;&#x5185;&#x6709;&#x6548;&#x7684;&#x5B8C;&#x6210;&#x8FC7;&#x6E21;&#x3002;&#x90A3;&#x4E48;&#x5982;&#x4F55;&#x628A;&#x63E1;&#x8FD9;&#x4E2A;&#x65F6;&#x95F4;&#x7684;&#x957F;&#x77ED;&#x5462;&#xFF1F;&#x4F26;&#x6566;&#x57CE;&#x5E02;&#x5B66;&#x9662;&#x795E;&#x7ECF;&#x5B66;&#x521B;&#x7ACB;&#x8005; <a href="http://www.ucl.ac.uk/media/library/blinking" target="_blank">Davina Bristow</a> &#x66FE;&#x63D0;&#x51FA;&#xFF0C; &#x7728;&#x773C;&#x662F;&#x4EBA;&#x4F53;&#x6700;&#x5FEB;&#x7684;&#x6F5C;&#x610F;&#x8BC6;&#x52A8;&#x4F5C;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x4EBA;&#x6BCF;&#x5206;&#x949F;&#x7728;&#x773C; 15 &#x6B21;&#xFF0C;&#x7728;&#x773C;&#x5E73;&#x5747;&#x6301;&#x7EED; 100-150 &#x6BEB;&#x79D2;&#xFF1B;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x5C06;&#x8FD9;&#x4E2A;&#x65F6;&#x95F4;&#x6BB5;&#x5B9A;&#x4E49;&#x6210; One Design &#x52A8;&#x6548;&#x7684;&#x57FA;&#x672C;&#x65F6;&#x95F4;&#x5355;&#x4F4D;&#x3002;</p>
<ul>
<li>&#x7EDF;&#x4E00;&#x7684;&#x7EC4;&#x4EF6;&#x52A8;&#x6548;&#x65F6;&#x95F4;&#x3002;&#x6700;&#x5FEB;&#x65F6;&#x95F4;: 100ms, &#x57FA;&#x672C;&#x65F6;&#x95F4;: 200ms, &#x8F83;&#x5927;&#x65F6;&#x95F4;&#xFF1A;300ms... 100 &#x7684;&#x500D;&#x589E;&#x65B9;&#x5F0F;</li>
</ul>
<p><img src="../images/foundation/motion/motion01.jpg" alt="&#x7EC4;&#x4EF6;&#x52A8;&#x6548;&#x65F6;&#x95F4;"></p>
<ul>
<li>&#x7EDF;&#x4E00;&#x7684;&#x9875;&#x9762;&#x8F6C;&#x6362;&#x52A8;&#x6548;&#x65F6;&#x95F4;&#x3002;&#x6700;&#x5FEB;&#x65F6;&#x95F4;: 150ms, &#x57FA;&#x672C;&#x65F6;&#x95F4;: 300ms, &#x5E73;&#x6ED1;&#x65F6;&#x95F4;&#xFF1A;450ms, &#x8F83;&#x5927;&#x65F6;&#x95F4;: 600ms... 150 &#x7684;&#x500D;&#x589E;&#x65B9;&#x5F0F;</li>
</ul>
<p><img src="../images/foundation/motion/motion02.jpg" alt="&#x9875;&#x9762;&#x52A8;&#x6548;&#x65F6;&#x95F4;"></p>
<ul>
<li>&#x7EC4;&#x4EF6;&#x6216;&#x8005;&#x9875;&#x9762;&#x7684;&#x52A8;&#x6548;&#x901F;&#x5EA6;&#xFF1A;&#x5300;&#x901F;&#x8FD0;&#x52A8;&#x3001;&#x52A0;&#x901F;&#x8FD0;&#x52A8;&#x548C;&#x51CF;&#x901F;&#x8FD0;&#x52A8;</li>
</ul>
<blockquote>
<p>&#x53C2;&#x8003; <a href="https://material.io/design/motion/speed.html#" target="_blank">Material Design- speed</a>&#x3001;<a href="https://design.teambition.com/visual-motion" target="_blank">Clarity Design - &#x65F6;&#x95F4;</a>&#x3001;<a href="https://motion.ant.design/language/speed-cn" target="_blank">Ant Motion - &#x901F;&#x5EA6;</a></p>
</blockquote>
<h1 id="&#x529B;&#x5EA6;">&#x529B;&#x5EA6;</h1>
<p>&#x53EF;&#x5206;&#x4E3A;&#x4E09;&#x79CD;&#x8FD0;&#x52A8;&#x529B;&#x5EA6;&#xFF0C;&#x5206;&#x522B;&#x662F;&#x6B63;&#x5E38;&#xFF0C;&#x91CD;&#xFF0C;&#x8F7B;&#x3002;&#x5728;&#x4F7F;&#x7528;&#x5C24;&#x5176;&#x662F;&#x63D0;&#x793A;&#x7C7B;&#x7EC4;&#x4EF6;&#x65F6;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x529B;&#x5EA6;&#x52A8;&#x753B;&#x8868;&#x73B0;&#x51FA;&#x4E86;&#x4E0D;&#x540C;&#x7684;&#x7D27;&#x6025;&#x7A0B;&#x5EA6;&#xFF0C;&#x4E09;&#x79CD;&#x8FD0;&#x52A8;&#x529B;&#x5EA6;&#x5206;&#x522B;&#x8868;&#x73B0;&#x666E;&#x901A;&#x63D0;&#x793A;&#x3001;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x63D0;&#x793A;&#x3001;&#x6B21;&#x8981;&#x63D0;&#x793A;&#x3002;&#x5168;&#x5C4F;&#x5F39;&#x51FA;&#x63D0;&#x793A;&#x540C;&#x6837;&#x4E5F;&#x5177;&#x5907;&#x4E0D;&#x540C;&#x7684;&#x529B;&#x5EA6;&#x3002;</p>
<p>&#x529B;&#x5EA6;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x6237;&#x5728;&#x4E0D;&#x7ECF;&#x610F;&#x95F4;&#xFF0C;&#x611F;&#x53D7;&#x5230;&#x4E0E;&#x7269;&#x7406;&#x4E16;&#x754C;&#x76F8;&#x540C;&#x7684;&#x91CD;&#x529B;&#x611F;&#x5E94;&#xFF0C;&#x901A;&#x8FC7;&#x66F4;&#x6539;&#x901F;&#x7387;&#x3001;&#x8FD0;&#x52A8;&#x8D8B;&#x52BF;&#x3001;&#x65F6;&#x6548;&#x7B49;&#x624B;&#x6BB5;&#xFF0C;&#x5448;&#x73B0;&#x4E09;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x529B;&#x5EA6;&#xFF0C;&#x5C06;&#x6709;&#x6548;&#x5730;&#x52A0;&#x5927;&#x4EA4;&#x4E92;&#x4F53;&#x9A8C;&#x4E0E;&#x7528;&#x6237;&#x60C5;&#x7EEA;&#x3001;&#x5FC3;&#x7406;&#x7684;&#x5173;&#x8054;&#x3002;&#x4ECE;&#x800C;&#x63D0;&#x4F9B;&#x771F;&#x5B9E;&#xFF0C;&#x53EF;&#x9760;&#x7684;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x3002;</p>
<p><img src="../images/foundation/motion/motion05.png" alt="&#x529B;&#x5EA6;"></p>
<blockquote>
<p>&#x53C2;&#x8003; <a href="https://design.teambition.com/visual-motion" target="_blank">Clarity Design - &#x529B;&#x5EA6;</a></p>
</blockquote>
<h1 id="&#x7A7A;&#x95F4;">&#x7A7A;&#x95F4;</h1>
<p>&#x73B0;&#x5B9E;&#x7A7A;&#x95F4;&#x91CC;&#xFF0C;&#x7269;&#x4F53;&#x5B58;&#x5728;&#x8FDC;&#x5C0F;&#x8FD1;&#x5927;&#x7684;&#x539F;&#x5219;&#xFF0C;&#x8FD0;&#x52A8;&#x5219;&#x6709;&#x8FDC;&#x6162;&#x8FD1;&#x5FEB;&#x3002;&#x5728;&#x52A8;&#x6548;&#x8BBE;&#x8BA1;&#x65F6;&#xFF0C;&#x5904;&#x7406;&#x548C;&#x7A7A;&#x95F4;&#x76F8;&#x5173;&#x7684;&#x8BDD;&#x9898;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x8003;&#x8651;&#x4E24;&#x65B9;&#x9762;&#x7684;&#x56E0;&#x7D20;&#xFF1A;</p>
<ul>
<li>&#x89C6;&#x5DEE;&#xFF1A;&#x4F8B;&#x5982;&#x6C7D;&#x8F66;&#x5728;&#x516C;&#x8DEF;&#x4E0A;&#x884C;&#x9A76;&#xFF0C;&#x79BB;&#x6C7D;&#x8F66;&#x8D8A;&#x8FD1;&#x7684;&#x7269;&#x4F53;&#xFF0C;&#x79FB;&#x52A8;&#x901F;&#x5EA6;&#x8D8A;&#x63A5;&#x8FD1;&#x6C7D;&#x8F66;&#x7684;&#x901F;&#x7387;&#x3002;&#x4EE5;&#x884C;&#x8FDB;&#x4E2D;&#x7684;&#x6C7D;&#x8F66;&#x4E3A;&#x4F8B;&#xFF0C;&#x6C7D;&#x8F66;&#x6240;&#x5728;&#x7684;&#x70B9;&#x4E3A; X &#x8F74;&#x7684;&#x57FA;&#x51C6;&#x70B9;&#xFF0C;&#x79BB;&#x57FA;&#x51C6;&#x70B9;&#x8D8A;&#x8FDC;&#x65F6;&#xFF0C;&#x901F;&#x5EA6;&#x5C31;&#x8D8A;&#x6162;&#x3002;&#x52A8;&#x6548;&#x8BBE;&#x8BA1;&#x4E2D;&#x540C;&#x6837;&#x5B58;&#x5728;&#x8FD9;&#x4E2A;&#x539F;&#x5219;&#xFF0C;&#x5143;&#x7D20;&#x7684;&#x7A7A;&#x95F4;&#x8DDD;&#x79BB;&#x4F1A;&#x5F71;&#x54CD;&#x52A8;&#x753B;&#x6548;&#x679C;&#xFF0C;&#x4ECE;&#x800C;&#x5F71;&#x54CD;&#x52A8;&#x6548;&#x8BBE;&#x8BA1;&#x7684;&#x51B3;&#x7B56;</li>
</ul>
<p><img src="../images/foundation/motion/motion04.png" alt="&#x89C6;&#x5DEE;"></p>
<ul>
<li>&#x5927;&#x5C0F;&#xFF1A;&#x9075;&#x5FAA;&#x8FDC;&#x5904;&#x7684;&#x7269;&#x4F53;&#x5C0F;&#xFF0C;&#x8FD1;&#x5904;&#x7684;&#x7269;&#x4F53;&#x5927;&#x7684;&#x539F;&#x5219;</li>
</ul>
<p><img src="../images/foundation/motion/motion03.png" alt="&#x5927;&#x5C0F;"></p>
<blockquote>
<p>&#x53C2;&#x8003; <a href="https://motion.ant.design/language/speed-cn" target="_blank">Ant Motion - &#x7A7A;&#x95F4;</a></p>
</blockquote>
<h1 id="&#x7EC4;&#x5408;">&#x7EC4;&#x5408;</h1>
<p>&#x7EC4;&#x5408;&#x52A8;&#x6548;&#x662F;&#x5C06;&#x591A;&#x79CD;&#x52A8;&#x753B;&#x6548;&#x679C;&#x7EC4;&#x5408;&#x8D77;&#x6765;&#x8FD0;&#x7528;&#x5728;&#x5355;&#x4E2A;&#x5143;&#x7D20;&#x6216;&#x8005;&#x754C;&#x9762;&#x4E2D;&#x7684;&#x8868;&#x73B0;&#x65B9;&#x5F0F;&#xFF0C;&#x5438;&#x5F15;&#x7528;&#x6237;&#x7684;&#x6CE8;&#x610F;&#xFF0C;&#x8BA9;&#x7528;&#x6237;&#x5FEB;&#x901F;&#x4E86;&#x89E3;&#x4FE1;&#x606F;&#x7684;&#x4E3B;&#x6B21;&#x5173;&#x7CFB;&#x3002;</p>
<ul>
<li><p>&#x5355;&#x5143;&#x7D20;&#x7EC4;&#x5408;&#x52A8;&#x753B;</p>
</li>
<li><p>&#x591A;&#x5143;&#x7D20;&#x5217;&#x961F;&#x52A8;&#x753B;</p>
</li>
<li><p>&#x591A;&#x5143;&#x7D20;&#x805A;&#x6563;&#x52A8;&#x753B;</p>
</li>
</ul>
<blockquote>
<p>&#x53C2;&#x8003; <a href="https://material.io/design/motion/choreography.html" target="_blank">Material Design- choreography</a>&#x3001;<a href="https://motion.ant.design/language/combined-cn" target="_blank">Ant Motion - &#x7EC4;&#x5408;</a></p>
</blockquote>
<h1 id="&#x8FC7;&#x6E21;">&#x8FC7;&#x6E21;</h1>
<p>&#x8FC7;&#x6E21;&#x662F;&#x66F4;&#x590D;&#x6742;&#x7684;&#x7EC4;&#x5408;&#x52A8;&#x753B;&#x6548;&#x679C;&#xFF0C;&#x7EC4;&#x5408;&#x52A8;&#x753B;&#x662F;&#x9488;&#x5BF9;&#x5F53;&#x524D;&#x7684;&#x5143;&#x7D20;&#x8FDB;&#x884C;&#x7684;&#x4E00;&#x4E2A;&#x8FDB;&#x51FA;&#x573A;&#x6548;&#x679C;&#xFF0C;&#x800C;&#x8FC7;&#x6E21;&#x5F80;&#x5F80;&#x9700;&#x8981;&#x591A;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x52A8;&#x753B;&#x6765;&#x5B8C;&#x6210;&#x4E00;&#x6BB5;&#x591A;&#x4E2A;&#x9875;&#x9762;&#x4E2D;&#x95F4;&#x7684;&#x8FC7;&#x6E21;&#x3002;</p>
<h2 id="&#x89C6;&#x89C9;&#x8FDE;&#x8D2F;&#x6027;&#x4E09;&#x5143;&#x7D20;">&#x89C6;&#x89C9;&#x8FDE;&#x8D2F;&#x6027;&#x4E09;&#x5143;&#x7D20;</h2>
<ul>
<li><p>Adding: &#x65B0;&#x52A0;&#x5165;&#x7684;&#x4FE1;&#x606F;&#x5143;&#x7D20;&#x5E94;&#x88AB;&#x544A;&#x77E5;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#xFF0C;&#x4ECE;&#x9875;&#x9762;&#x8F6C;&#x53D8;&#x7684;&#x4FE1;&#x606F;&#x5143;&#x7D20;&#x9700;&#x88AB;&#x91CD;&#x65B0;&#x8BC6;&#x522B;</p>
</li>
<li><p>Receding: &#x4E0E;&#x5F53;&#x524D;&#x9875;&#x65E0;&#x5173;&#x7684;&#x4FE1;&#x606F;&#x5143;&#x7D20;&#x5E94;&#x91C7;&#x7528;&#x9002;&#x5F53;&#x65B9;&#x5F0F;&#x79FB;&#x9664;</p>
</li>
<li><p>Normal: &#x6307;&#x90A3;&#x4E9B;&#x4ECE;&#x8F6C;&#x573A;&#x5F00;&#x59CB;&#x5230;&#x7ED3;&#x675F;&#x90FD;&#x6CA1;&#x6709;&#x53D1;&#x751F;&#x53D8;&#x5316;&#x7684;&#x4FE1;&#x606F;&#x5143;&#x7D20;</p>
</li>
</ul>
<blockquote>
<p>&#x53C2;&#x8003; <a href="https://motion.ant.design/language/transition-cn#%E8%A7%86%E8%A7%89%E8%BF%9E%E8%B4%AF%E6%80%A7%E4%B8%89%E5%85%83%E7%B4%A0" target="_blank">Ant Motion - &#x89C6;&#x89C9;&#x8FDE;&#x8D2F;&#x6027;&#x4E09;&#x5143;&#x7D20;</a></p>
</blockquote>
<h2 id="&#x89C6;&#x56FE;&#x53D8;&#x5316;&#x65F6;&#x4FDD;&#x6301;&#x4E0A;&#x4E0B;&#x6587;">&#x89C6;&#x56FE;&#x53D8;&#x5316;&#x65F6;&#x4FDD;&#x6301;&#x4E0A;&#x4E0B;&#x6587;</h2>
<ul>
<li><p>&#x9875;&#x9762;&#x95F4;&#x5207;&#x6362;</p>
</li>
<li><p>&#x4F20;&#x9001;&#x5E26;&#x5207;&#x6362;(&#x8D70;&#x9A6C;&#x706F;)</p>
</li>
<li><p>&#x6298;&#x53E0;&#x7A97;&#x53E3;</p>
</li>
</ul>
<blockquote>
<p>&#x53C2;&#x8003; <a href="https://motion.ant.design/language/transition-cn#%E8%A7%86%E5%9B%BE%E5%8F%98%E5%8C%96%E6%97%B6%E4%BF%9D%E6%8C%81%E4%B8%8A%E4%B8%8B%E6%96%87" target="_blank">Ant Motion - &#x89C6;&#x56FE;&#x53D8;&#x5316;&#x65F6;&#x4FDD;&#x6301;&#x4E0A;&#x4E0B;&#x6587;</a></p>
</blockquote>
<h2 id="&#x89E3;&#x91CA;&#x521A;&#x521A;&#x53D1;&#x751F;&#x4E86;&#x4EC0;&#x4E48;">&#x89E3;&#x91CA;&#x521A;&#x521A;&#x53D1;&#x751F;&#x4E86;&#x4EC0;&#x4E48;</h2>
<p>&#x5C06;&#x7528;&#x6237;&#x64CD;&#x4F5C;&#x53EF;&#x89C6;&#x5316;, &#x6765;&#x589E;&#x5F3A;&#x7528;&#x6237;&#x5BF9;&#x64CD;&#x4F5C;&#x884C;&#x4E3A;&#x7684;&#x611F;&#x77E5;&#x5EA6;, &#x540C;&#x65F6;&#x4E5F;&#x80FD;&#x5BF9;&#x5143;&#x7D20;&#x5185;&#x5BB9;&#x7684;&#x8BA4;&#x77E5;;</p>
<p>&#x5728;&#x5217;&#x8868;&#x6216;&#x8868;&#x683C;&#x4E2D;, &#x53D8;&#x66F4;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x65F6;, &#x52A0;&#x5165;&#x5BF9;&#x8C61;&#x51FA;&#x73B0;&#x4E0E;&#x6D88;&#x5931;&#x6548;&#x679C;, &#x4EE5;&#x63D0;&#x793A;&#x7528;&#x6237;&#x6240;&#x64CD;&#x4F5C;&#x7684;&#x884C;&#x4E3A;&#x3002;</p>
<ul>
<li><p>&#x5BF9;&#x8C61;&#x589E;&#x52A0;&#xFF1A;&#x589E;&#x52A0;&#x540E;, &#x7528;&#x4E00;&#x4E2A;&#x52A8;&#x753B;&#x548C;&#x80CC;&#x666F;&#x8272;&#x6765;&#x533A;&#x5206;&#x65B0;&#x589E;&#x5143;&#x7D20;, &#x8FC7;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x518D;&#x6062;&#x590D;&#x6B63;&#x5E38;</p>
</li>
<li><p>&#x5BF9;&#x8C61;&#x5220;&#x9664;&#xFF1A;&#x5220;&#x9664;&#x540E;, &#x7528;&#x79FB;&#x51FA;&#x7684;&#x6548;&#x679C;&#x6765;&#x505A;&#x5220;&#x9664;&#x7684;&#x6548;&#x679C;</p>
</li>
<li><p>&#x5BF9;&#x8C61;&#x66F4;&#x6539;&#xFF1A;&#x7528;&#x6237;&#x66F4;&#x6539;&#x4E86;&#x5185;&#x5BB9;&#x65F6;, &#x5728;&#x4FDD;&#x5B58;&#x540E;, &#x5728;&#x4FEE;&#x6539;&#x8FC7;&#x7684;&#x4F4D;&#x7F6E;&#x51FA;&#x73B0;&#x80CC;&#x666F;&#x8272;, &#x8868;&#x793A;&#x8BE5;&#x5BF9;&#x8C61;&#x53D1;&#x751F;&#x8FC7;&#x53D8;&#x66F4;, &#x7136;&#x540E;&#x80CC;&#x666F;&#x8272;&#x6301;&#x7EED;&#x4E00;&#x65AD;&#x65F6;&#x95F4;&#x518D;&#x6D88;&#x5931;, &#x6062;&#x590D;&#x6B63;&#x5E38;</p>
</li>
<li><p>&#x5F39;&#x51FA;&#x6846;&#x547C;&#x51FA;&#xFF1A;&#x4ECE;&#x9875;&#x9762;&#x7684;&#x67D0;&#x4E2A;&#x6309;&#x94AE;&#x547C;&#x51FA;&#x5F39;&#x51FA;&#x6846;&#x65F6;, &#x5F39;&#x6846;&#x4ECE;&#x6309;&#x94AE;&#x5904;&#x547C;&#x8D77;, &#x53EF;&#x63D0;&#x793A;&#x7528;&#x6237;&#x5F39;&#x6846;&#x4E0E;&#x6309;&#x94AE;&#x7684;&#x5173;&#x7CFB;</p>
</li>
</ul>
<blockquote>
<p>&#x53C2;&#x8003; <a href="https://motion.ant.design/language/transition-cn#%E8%A7%A3%E9%87%8A%E5%88%9A%E5%88%9A%E5%8F%91%E7%94%9F%E4%BA%86%E4%BB%80%E4%B9%88" target="_blank">Ant Motion - &#x89E3;&#x91CA;&#x521A;&#x521A;&#x53D1;&#x751F;&#x4E86;&#x4EC0;&#x4E48;</a></p>
</blockquote>
<h2 id="&#x6539;&#x5584;&#x611F;&#x77E5;&#x6027;&#x80FD;">&#x6539;&#x5584;&#x611F;&#x77E5;&#x6027;&#x80FD;</h2>
<p>&#x5F53;&#x65E0;&#x6CD5;&#x6709;&#x6548;&#x63D0;&#x5347;&#x300E;&#x5B9E;&#x9645;&#x6027;&#x80FD;&#x300F;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x9002;&#x5F53;&#x8F6C;&#x79FB;&#x7528;&#x6237;&#x7684;&#x6CE8;&#x610F;&#x529B;&#xFF0C;&#x6765;&#x7F29;&#x77ED;&#x67D0;&#x9879;&#x64CD;&#x4F5C;&#x7684;&#x611F;&#x77E5;&#x65F6;&#x95F4;&#xFF0C;&#x6539;&#x5584;&#x611F;&#x77E5;&#x6027;&#x80FD;&#x3002;</p>
<blockquote>
<p>&#x53C2;&#x8003; <a href="https://motion.ant.design/language/transition-cn#%E6%94%B9%E5%96%84%E6%84%9F%E7%9F%A5%E6%80%A7%E8%83%BD" target="_blank">Ant Motion - &#x6539;&#x5584;&#x611F;&#x77E5;&#x6027;&#x80FD;</a></p>
</blockquote>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="interaction.html" class="navigation navigation-prev " aria-label="Previous page: Interaction 交互">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="communication.html" class="navigation navigation-next " aria-label="Next page: Communication 沟通">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Motion 动效","level":"1.2.9","depth":2,"next":{"title":"Communication 沟通","level":"1.2.10","depth":2,"path":"foundation/communication.md","ref":"foundation/communication.md","articles":[]},"previous":{"title":"Interaction 交互","level":"1.2.8","depth":2,"path":"foundation/interaction.md","ref":"foundation/interaction.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"foundation/motion.md","mtime":"2019-02-28T12:18:32.178Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-02-28T12:19:54.646Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

